In [8]:
import pandas as pd
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [9]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [15]:
# find unique states 
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [16]:
# find number of unique states 
df_one['col2'].nunique()

5

In [17]:
# find the count of each unique state
df_one['col2'].value_counts()

WA    2
NY    1
CA    1
AK    1
NV    1
Name: col2, dtype: int64

In [27]:
# remove duplicate states
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [33]:
# create a function that grabs the first letter of each state
def myfun(state):
    return state[0]

In [35]:
myfun('LON')

'L'

In [36]:
# set the result (of above function) as new column 
df_one['col2'].apply(myfun)

0    N
1    C
2    W
3    W
4    A
5    N
Name: col2, dtype: object

In [46]:
# create a function that completes 'W' ==> 'Washington', else ==> 'Error' 
def myfun(state):
    if state[0] == 'W':
        return 'Washington'
    else:
        return 'Error'

In [47]:
myfun('W')

'Washington'

In [48]:
# set the result (of above function) as new column
df_one['col2'].apply(myfun)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [56]:
# map letters (A,B,C) in column 'k1' to numbers (1,2,3) 
mydic = {'A':1, 'B':2,'C':3}
df_one['mapped'] = df_one['k1'].map(mydic)
df_one

  k1  col1 col2  mapped
0  A   100   NY       1
1  A   200   CA       1
2  B   300   WA       2
3  B   300   WA       2
4  C   400   AK       3
5  C   500   NV       3

In [57]:
# what is the index of the maximum in 'col1' 
df_one['col1'].idxmax()

5

In [59]:
# list all column/index names in your df 
df_one.index

RangeIndex(start=0, stop=6, step=1)

In [61]:
# reassign column names in your df
df_one.columns = ['c1','C2','c3','C4']
df_one

  c1   C2  c3  C4
0  A  100  NY   1
1  A  200  CA   1
2  B  300  WA   2
3  B  300  WA   2
4  C  400  AK   3
5  C  500  NV   3

In [63]:
# use 'c3' to sort df
df_one.sort_values('c3',ascending=False)

  c1   C2  c3  C4
2  B  300  WA   2
3  B  300  WA   2
0  A  100  NY   1
5  C  500  NV   3
1  A  200  CA   1
4  C  400  AK   3

In [64]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [65]:
# join features and labels into one df 
pd.concat([features,predictions],1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [69]:
# create one-hot from column 'c1'
pd.get_dummies(df_one['c1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1